apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core0.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core0.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_INTERRUPT_CORE0_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_INTERRUPT_CORE0_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define DR_REG_INTERRUPT_CORE0_BASE     DR_REG_INTERRUPT_BASE

/* INTERRUPT_CORE0_MAC_INTR_MAP_REG register
 * mac interrupt configuration register
 */

#define INTERRUPT_CORE0_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x0)

/* INTERRUPT_CORE0_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map mac interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_MAC_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_MAC_INTR_MAP_M  (INTERRUPT_CORE0_MAC_INTR_MAP_V << INTERRUPT_CORE0_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_MAC_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_MAC_INTR_MAP_S  0

/* INTERRUPT_CORE0_MAC_NMI_MAP_REG register
 * mac_nmi interrupt configuration register
 */

#define INTERRUPT_CORE0_MAC_NMI_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x4)

/* INTERRUPT_CORE0_MAC_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map_nmi interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_MAC_NMI_MAP    0x0000001f
#define INTERRUPT_CORE0_MAC_NMI_MAP_M  (INTERRUPT_CORE0_MAC_NMI_MAP_V << INTERRUPT_CORE0_MAC_NMI_MAP_S)
#define INTERRUPT_CORE0_MAC_NMI_MAP_V  0x0000001f
#define INTERRUPT_CORE0_MAC_NMI_MAP_S  0

/* INTERRUPT_CORE0_PWR_INTR_MAP_REG register
 * pwr interrupt configuration register
 */

#define INTERRUPT_CORE0_PWR_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x8)

/* INTERRUPT_CORE0_PWR_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwr interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_PWR_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_PWR_INTR_MAP_M  (INTERRUPT_CORE0_PWR_INTR_MAP_V << INTERRUPT_CORE0_PWR_INTR_MAP_S)
#define INTERRUPT_CORE0_PWR_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_PWR_INTR_MAP_S  0

/* INTERRUPT_CORE0_BB_INT_MAP_REG register
 * bb interrupt configuration register
 */

#define INTERRUPT_CORE0_BB_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc)

/* INTERRUPT_CORE0_BB_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map bb interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_BB_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_BB_INT_MAP_M  (INTERRUPT_CORE0_BB_INT_MAP_V << INTERRUPT_CORE0_BB_INT_MAP_S)
#define INTERRUPT_CORE0_BB_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_BB_INT_MAP_S  0

/* INTERRUPT_CORE0_BT_MAC_INT_MAP_REG register
 * bb_mac interrupt configuration register
 */

#define INTERRUPT_CORE0_BT_MAC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x10)

/* INTERRUPT_CORE0_BT_MAC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map bb_mac interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_BT_MAC_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_BT_MAC_INT_MAP_M  (INTERRUPT_CORE0_BT_MAC_INT_MAP_V << INTERRUPT_CORE0_BT_MAC_INT_MAP_S)
#define INTERRUPT_CORE0_BT_MAC_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_BT_MAC_INT_MAP_S  0

/* INTERRUPT_CORE0_BT_BB_INT_MAP_REG register
 * bt_bb interrupt configuration register
 */

#define INTERRUPT_CORE0_BT_BB_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x14)

/* INTERRUPT_CORE0_BT_BB_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map bt_bb interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_BT_BB_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_BT_BB_INT_MAP_M  (INTERRUPT_CORE0_BT_BB_INT_MAP_V << INTERRUPT_CORE0_BT_BB_INT_MAP_S)
#define INTERRUPT_CORE0_BT_BB_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_BT_BB_INT_MAP_S  0

/* INTERRUPT_CORE0_BT_BB_NMI_MAP_REG register
 * bt_bb_nmi interrupt configuration register
 */

#define INTERRUPT_CORE0_BT_BB_NMI_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x18)

/* INTERRUPT_CORE0_BT_BB_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map bb_bt_nmi interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_BT_BB_NMI_MAP    0x0000001f
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_M  (INTERRUPT_CORE0_BT_BB_NMI_MAP_V << INTERRUPT_CORE0_BT_BB_NMI_MAP_S)
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_V  0x0000001f
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_S  0

/* INTERRUPT_CORE0_RWBT_IRQ_MAP_REG register
 * rwbt_irq interrupt configuration register
 */

#define INTERRUPT_CORE0_RWBT_IRQ_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c)

/* INTERRUPT_CORE0_RWBT_IRQ_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rwbt_irq interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_RWBT_IRQ_MAP    0x0000001f
#define INTERRUPT_CORE0_RWBT_IRQ_MAP_M  (INTERRUPT_CORE0_RWBT_IRQ_MAP_V << INTERRUPT_CORE0_RWBT_IRQ_MAP_S)
#define INTERRUPT_CORE0_RWBT_IRQ_MAP_V  0x0000001f
#define INTERRUPT_CORE0_RWBT_IRQ_MAP_S  0

