apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core0.h
#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x48)

/* INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map gpio_interrupt_app interrupt to one of core0's
 * external interrupt
 */

#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP    0x0000001f
#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP_V << INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP_V  0x0000001f
#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_MAP_S  0

/* INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP_REG register
 * gpio_interrupt_app_nmi interrupt configuration register
 */

#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x4c)

/* INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * this register used to map gpio_interrupt_app_nmi interrupt to one of
 * core0's external interrupt
 */

#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP    0x0000001f
#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP_V << INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP_V  0x0000001f
#define INTERRUPT_CORE0_GPIO_INTERRUPT_APP_NMI_MAP_S  0

/* INTERRUPT_CORE0_SPI_INTR_1_MAP_REG register
 * spi_intr_1 interrupt configuration register
 */

#define INTERRUPT_CORE0_SPI_INTR_1_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x50)

/* INTERRUPT_CORE0_SPI_INTR_1_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi_intr_1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_SPI_INTR_1_MAP    0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_1_MAP_M  (INTERRUPT_CORE0_SPI_INTR_1_MAP_V << INTERRUPT_CORE0_SPI_INTR_1_MAP_S)
#define INTERRUPT_CORE0_SPI_INTR_1_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_1_MAP_S  0

/* INTERRUPT_CORE0_SPI_INTR_2_MAP_REG register
 * spi_intr_2 interrupt configuration register
 */

#define INTERRUPT_CORE0_SPI_INTR_2_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x54)

/* INTERRUPT_CORE0_SPI_INTR_2_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi_intr_2 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_SPI_INTR_2_MAP    0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_2_MAP_M  (INTERRUPT_CORE0_SPI_INTR_2_MAP_V << INTERRUPT_CORE0_SPI_INTR_2_MAP_S)
#define INTERRUPT_CORE0_SPI_INTR_2_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_2_MAP_S  0

/* INTERRUPT_CORE0_SPI_INTR_3_MAP_REG register
 * spi_intr_3 interrupt configuration register
 */

#define INTERRUPT_CORE0_SPI_INTR_3_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x58)

/* INTERRUPT_CORE0_SPI_INTR_3_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi_intr_3 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_SPI_INTR_3_MAP    0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_3_MAP_M  (INTERRUPT_CORE0_SPI_INTR_3_MAP_V << INTERRUPT_CORE0_SPI_INTR_3_MAP_S)
#define INTERRUPT_CORE0_SPI_INTR_3_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_3_MAP_S  0

/* INTERRUPT_CORE0_SPI_INTR_4_MAP_REG register
 * spi_intr_4 interrupt configuration register
 */

#define INTERRUPT_CORE0_SPI_INTR_4_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x5c)

/* INTERRUPT_CORE0_SPI_INTR_4_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi_intr_4 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_SPI_INTR_4_MAP    0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_4_MAP_M  (INTERRUPT_CORE0_SPI_INTR_4_MAP_V << INTERRUPT_CORE0_SPI_INTR_4_MAP_S)
#define INTERRUPT_CORE0_SPI_INTR_4_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SPI_INTR_4_MAP_S  0

/* INTERRUPT_CORE0_LCD_CAM_INT_MAP_REG register
 * lcd_cam interrupt configuration register
 */

#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x60)

/* INTERRUPT_CORE0_LCD_CAM_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map lcd_cam interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_LCD_CAM_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_M  (INTERRUPT_CORE0_LCD_CAM_INT_MAP_V << INTERRUPT_CORE0_LCD_CAM_INT_MAP_S)
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_S  0

/* INTERRUPT_CORE0_I2S0_INT_MAP_REG register
 * i2s0 interrupt configuration register
 */

#define INTERRUPT_CORE0_I2S0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x64)

/* INTERRUPT_CORE0_I2S0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map i2s0 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_I2S0_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_I2S0_INT_MAP_M  (INTERRUPT_CORE0_I2S0_INT_MAP_V << INTERRUPT_CORE0_I2S0_INT_MAP_S)
#define INTERRUPT_CORE0_I2S0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_I2S0_INT_MAP_S  0

/* INTERRUPT_CORE0_I2S1_INT_MAP_REG register
 * i2s1 interrupt configuration register
 */

#define INTERRUPT_CORE0_I2S1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x68)

/* INTERRUPT_CORE0_I2S1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map i2s1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_I2S1_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_I2S1_INT_MAP_M  (INTERRUPT_CORE0_I2S1_INT_MAP_V << INTERRUPT_CORE0_I2S1_INT_MAP_S)
#define INTERRUPT_CORE0_I2S1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_I2S1_INT_MAP_S  0

/* INTERRUPT_CORE0_UART_INTR_MAP_REG register
 * uart interrupt configuration register
 */

#define INTERRUPT_CORE0_UART_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x6c)

/* INTERRUPT_CORE0_UART_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map uart interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_UART_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_UART_INTR_MAP_M  (INTERRUPT_CORE0_UART_INTR_MAP_V << INTERRUPT_CORE0_UART_INTR_MAP_S)
#define INTERRUPT_CORE0_UART_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_UART_INTR_MAP_S  0

/* INTERRUPT_CORE0_UART1_INTR_MAP_REG register
 * uart1 interrupt configuration register
 */

#define INTERRUPT_CORE0_UART1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x70)

/* INTERRUPT_CORE0_UART1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map uart1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_UART1_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_UART1_INTR_MAP_M  (INTERRUPT_CORE0_UART1_INTR_MAP_V << INTERRUPT_CORE0_UART1_INTR_MAP_S)
#define INTERRUPT_CORE0_UART1_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_UART1_INTR_MAP_S  0

/* INTERRUPT_CORE0_UART2_INTR_MAP_REG register
 * uart2 interrupt configuration register
 */

#define INTERRUPT_CORE0_UART2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x74)

/* INTERRUPT_CORE0_UART2_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map uart2 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_UART2_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_UART2_INTR_MAP_M  (INTERRUPT_CORE0_UART2_INTR_MAP_V << INTERRUPT_CORE0_UART2_INTR_MAP_S)
#define INTERRUPT_CORE0_UART2_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_UART2_INTR_MAP_S  0

/* INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP_REG register
 * sdio_host interrupt configuration register
 */

#define INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x78)

/* INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map sdio_host interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP    0x0000001f
#define INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP_M  (INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP_V << INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP_S)
#define INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SDIO_HOST_INTERRUPT_MAP_S  0

/* INTERRUPT_CORE0_PWM0_INTR_MAP_REG register
 * pwm0 interrupt configuration register
 */

#define INTERRUPT_CORE0_PWM0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x7c)

/* INTERRUPT_CORE0_PWM0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm0 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_PWM0_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_PWM0_INTR_MAP_M  (INTERRUPT_CORE0_PWM0_INTR_MAP_V << INTERRUPT_CORE0_PWM0_INTR_MAP_S)
#define INTERRUPT_CORE0_PWM0_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_PWM0_INTR_MAP_S  0

/* INTERRUPT_CORE0_PWM1_INTR_MAP_REG register
 * pwm1 interrupt configuration register
 */

#define INTERRUPT_CORE0_PWM1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x80)

/* INTERRUPT_CORE0_PWM1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_PWM1_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_PWM1_INTR_MAP_M  (INTERRUPT_CORE0_PWM1_INTR_MAP_V << INTERRUPT_CORE0_PWM1_INTR_MAP_S)
#define INTERRUPT_CORE0_PWM1_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_PWM1_INTR_MAP_S  0

/* INTERRUPT_CORE0_PWM2_INTR_MAP_REG register
 * pwm2 interrupt configuration register
 */

#define INTERRUPT_CORE0_PWM2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x84)

/* INTERRUPT_CORE0_PWM2_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm2 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_PWM2_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_PWM2_INTR_MAP_M  (INTERRUPT_CORE0_PWM2_INTR_MAP_V << INTERRUPT_CORE0_PWM2_INTR_MAP_S)
#define INTERRUPT_CORE0_PWM2_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_PWM2_INTR_MAP_S  0

/* INTERRUPT_CORE0_PWM3_INTR_MAP_REG register
 * pwm3 interrupt configuration register
 */

