apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core0.h
#define INTERRUPT_CORE0_PWM3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x88)

/* INTERRUPT_CORE0_PWM3_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pwm3 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_PWM3_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_PWM3_INTR_MAP_M  (INTERRUPT_CORE0_PWM3_INTR_MAP_V << INTERRUPT_CORE0_PWM3_INTR_MAP_S)
#define INTERRUPT_CORE0_PWM3_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_PWM3_INTR_MAP_S  0

/* INTERRUPT_CORE0_LEDC_INT_MAP_REG register
 * ledc interrupt configuration register
 */

#define INTERRUPT_CORE0_LEDC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x8c)

/* INTERRUPT_CORE0_LEDC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map ledc interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_LEDC_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_LEDC_INT_MAP_M  (INTERRUPT_CORE0_LEDC_INT_MAP_V << INTERRUPT_CORE0_LEDC_INT_MAP_S)
#define INTERRUPT_CORE0_LEDC_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_LEDC_INT_MAP_S  0

/* INTERRUPT_CORE0_EFUSE_INT_MAP_REG register
 * efuse interrupt configuration register
 */

#define INTERRUPT_CORE0_EFUSE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x90)

/* INTERRUPT_CORE0_EFUSE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map efuse interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_EFUSE_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_EFUSE_INT_MAP_M  (INTERRUPT_CORE0_EFUSE_INT_MAP_V << INTERRUPT_CORE0_EFUSE_INT_MAP_S)
#define INTERRUPT_CORE0_EFUSE_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_EFUSE_INT_MAP_S  0

/* INTERRUPT_CORE0_CAN_INT_MAP_REG register
 * can interrupt configuration register
 */

#define INTERRUPT_CORE0_CAN_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x94)

/* INTERRUPT_CORE0_CAN_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map can interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_CAN_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_CAN_INT_MAP_M  (INTERRUPT_CORE0_CAN_INT_MAP_V << INTERRUPT_CORE0_CAN_INT_MAP_S)
#define INTERRUPT_CORE0_CAN_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_CAN_INT_MAP_S  0

/* INTERRUPT_CORE0_USB_INTR_MAP_REG register
 * usb interrupt configuration register
 */

#define INTERRUPT_CORE0_USB_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x98)

/* INTERRUPT_CORE0_USB_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map usb interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_USB_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_USB_INTR_MAP_M  (INTERRUPT_CORE0_USB_INTR_MAP_V << INTERRUPT_CORE0_USB_INTR_MAP_S)
#define INTERRUPT_CORE0_USB_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_USB_INTR_MAP_S  0

/* INTERRUPT_CORE0_RTC_CORE_INTR_MAP_REG register
 * rtc_core interrupt configuration register
 */

#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x9c)

/* INTERRUPT_CORE0_RTC_CORE_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rtc_core interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_M  (INTERRUPT_CORE0_RTC_CORE_INTR_MAP_V << INTERRUPT_CORE0_RTC_CORE_INTR_MAP_S)
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_S  0

/* INTERRUPT_CORE0_RMT_INTR_MAP_REG register
 * rmt interrupt configuration register
 */

#define INTERRUPT_CORE0_RMT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xa0)

/* INTERRUPT_CORE0_RMT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rmt interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_RMT_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_RMT_INTR_MAP_M  (INTERRUPT_CORE0_RMT_INTR_MAP_V << INTERRUPT_CORE0_RMT_INTR_MAP_S)
#define INTERRUPT_CORE0_RMT_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_RMT_INTR_MAP_S  0

/* INTERRUPT_CORE0_PCNT_INTR_MAP_REG register
 * pcnt interrupt configuration register
 */

#define INTERRUPT_CORE0_PCNT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xa4)

/* INTERRUPT_CORE0_PCNT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map pcnt interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_PCNT_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_PCNT_INTR_MAP_M  (INTERRUPT_CORE0_PCNT_INTR_MAP_V << INTERRUPT_CORE0_PCNT_INTR_MAP_S)
#define INTERRUPT_CORE0_PCNT_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_PCNT_INTR_MAP_S  0

/* INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_REG register
 * i2c_ext0 interrupt configuration register
 */

#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xa8)

/* INTERRUPT_CORE0_I2C_EXT0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map i2c_ext0 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_M  (INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_V << INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_S)
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_S  0

/* INTERRUPT_CORE0_I2C_EXT1_INTR_MAP_REG register
 * i2c_ext1 interrupt configuration register
 */

#define INTERRUPT_CORE0_I2C_EXT1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xac)

/* INTERRUPT_CORE0_I2C_EXT1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map i2c_ext1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_I2C_EXT1_INTR_MAP    0x0000001f
#define INTERRUPT_CORE0_I2C_EXT1_INTR_MAP_M  (INTERRUPT_CORE0_I2C_EXT1_INTR_MAP_V << INTERRUPT_CORE0_I2C_EXT1_INTR_MAP_S)
#define INTERRUPT_CORE0_I2C_EXT1_INTR_MAP_V  0x0000001f
#define INTERRUPT_CORE0_I2C_EXT1_INTR_MAP_S  0

/* INTERRUPT_CORE0_SPI2_DMA_INT_MAP_REG register
 * spi2_dma interrupt configuration register
 */

#define INTERRUPT_CORE0_SPI2_DMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xb0)

/* INTERRUPT_CORE0_SPI2_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi2_dma interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_SPI2_DMA_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_SPI2_DMA_INT_MAP_M  (INTERRUPT_CORE0_SPI2_DMA_INT_MAP_V << INTERRUPT_CORE0_SPI2_DMA_INT_MAP_S)
#define INTERRUPT_CORE0_SPI2_DMA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SPI2_DMA_INT_MAP_S  0

/* INTERRUPT_CORE0_SPI3_DMA_INT_MAP_REG register
 * spi3_dma interrupt configuration register
 */

#define INTERRUPT_CORE0_SPI3_DMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xb4)

/* INTERRUPT_CORE0_SPI3_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi3_dma interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_SPI3_DMA_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_SPI3_DMA_INT_MAP_M  (INTERRUPT_CORE0_SPI3_DMA_INT_MAP_V << INTERRUPT_CORE0_SPI3_DMA_INT_MAP_S)
#define INTERRUPT_CORE0_SPI3_DMA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SPI3_DMA_INT_MAP_S  0

/* INTERRUPT_CORE0_SPI4_DMA_INT_MAP_REG register
 * spi4_dma interrupt configuration register
 */

#define INTERRUPT_CORE0_SPI4_DMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xb8)

/* INTERRUPT_CORE0_SPI4_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map spi4_dma interrupt to one of core0's external
 * interrupt
 */

