apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core0.h
#define INTERRUPT_CORE0_SPI4_DMA_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_SPI4_DMA_INT_MAP_M  (INTERRUPT_CORE0_SPI4_DMA_INT_MAP_V << INTERRUPT_CORE0_SPI4_DMA_INT_MAP_S)
#define INTERRUPT_CORE0_SPI4_DMA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_SPI4_DMA_INT_MAP_S  0

/* INTERRUPT_CORE0_WDG_INT_MAP_REG register
 * wdg interrupt configuration register
 */

#define INTERRUPT_CORE0_WDG_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xbc)

/* INTERRUPT_CORE0_WDG_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map wdg interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_WDG_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_WDG_INT_MAP_M  (INTERRUPT_CORE0_WDG_INT_MAP_V << INTERRUPT_CORE0_WDG_INT_MAP_S)
#define INTERRUPT_CORE0_WDG_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_WDG_INT_MAP_S  0

/* INTERRUPT_CORE0_TIMER_INT1_MAP_REG register
 * timer_int1 interrupt configuration register
 */

#define INTERRUPT_CORE0_TIMER_INT1_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc0)

/* INTERRUPT_CORE0_TIMER_INT1_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map timer_int1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TIMER_INT1_MAP    0x0000001f
#define INTERRUPT_CORE0_TIMER_INT1_MAP_M  (INTERRUPT_CORE0_TIMER_INT1_MAP_V << INTERRUPT_CORE0_TIMER_INT1_MAP_S)
#define INTERRUPT_CORE0_TIMER_INT1_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TIMER_INT1_MAP_S  0

/* INTERRUPT_CORE0_TIMER_INT2_MAP_REG register
 * timer_int2 interrupt configuration register
 */

#define INTERRUPT_CORE0_TIMER_INT2_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc4)

/* INTERRUPT_CORE0_TIMER_INT2_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map timer_int2 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TIMER_INT2_MAP    0x0000001f
#define INTERRUPT_CORE0_TIMER_INT2_MAP_M  (INTERRUPT_CORE0_TIMER_INT2_MAP_V << INTERRUPT_CORE0_TIMER_INT2_MAP_S)
#define INTERRUPT_CORE0_TIMER_INT2_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TIMER_INT2_MAP_S  0

/* INTERRUPT_CORE0_TG_T0_INT_MAP_REG register
 * tg_t0 interrupt configuration register
 */

#define INTERRUPT_CORE0_TG_T0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc8)

/* INTERRUPT_CORE0_TG_T0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg_t0 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TG_T0_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_TG_T0_INT_MAP_M  (INTERRUPT_CORE0_TG_T0_INT_MAP_V << INTERRUPT_CORE0_TG_T0_INT_MAP_S)
#define INTERRUPT_CORE0_TG_T0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TG_T0_INT_MAP_S  0

/* INTERRUPT_CORE0_TG_T1_INT_MAP_REG register
 * tg_t1 interrupt configuration register
 */

#define INTERRUPT_CORE0_TG_T1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xcc)

/* INTERRUPT_CORE0_TG_T1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg_t1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TG_T1_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_TG_T1_INT_MAP_M  (INTERRUPT_CORE0_TG_T1_INT_MAP_V << INTERRUPT_CORE0_TG_T1_INT_MAP_S)
#define INTERRUPT_CORE0_TG_T1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TG_T1_INT_MAP_S  0

/* INTERRUPT_CORE0_TG_WDT_INT_MAP_REG register
 * tg_wdt interrupt configuration register
 */

#define INTERRUPT_CORE0_TG_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xd0)

/* INTERRUPT_CORE0_TG_WDT_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rg_wdt interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TG_WDT_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_TG_WDT_INT_MAP_M  (INTERRUPT_CORE0_TG_WDT_INT_MAP_V << INTERRUPT_CORE0_TG_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_TG_WDT_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TG_WDT_INT_MAP_S  0

/* INTERRUPT_CORE0_TG1_T0_INT_MAP_REG register
 * tg1_t0 interrupt configuration register
 */

#define INTERRUPT_CORE0_TG1_T0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xd4)

/* INTERRUPT_CORE0_TG1_T0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg1_t0 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TG1_T0_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_TG1_T0_INT_MAP_M  (INTERRUPT_CORE0_TG1_T0_INT_MAP_V << INTERRUPT_CORE0_TG1_T0_INT_MAP_S)
#define INTERRUPT_CORE0_TG1_T0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TG1_T0_INT_MAP_S  0

/* INTERRUPT_CORE0_TG1_T1_INT_MAP_REG register
 * tg1_t1 interrupt configuration register
 */

#define INTERRUPT_CORE0_TG1_T1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xd8)

/* INTERRUPT_CORE0_TG1_T1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg1_t1 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TG1_T1_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_TG1_T1_INT_MAP_M  (INTERRUPT_CORE0_TG1_T1_INT_MAP_V << INTERRUPT_CORE0_TG1_T1_INT_MAP_S)
#define INTERRUPT_CORE0_TG1_T1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TG1_T1_INT_MAP_S  0

/* INTERRUPT_CORE0_TG1_WDT_INT_MAP_REG register
 * tg1_wdt interrupt configuration register
 */

#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xdc)

/* INTERRUPT_CORE0_TG1_WDT_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map tg1_wdt interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_TG1_WDT_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_M  (INTERRUPT_CORE0_TG1_WDT_INT_MAP_V << INTERRUPT_CORE0_TG1_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_S  0

/* INTERRUPT_CORE0_CACHE_IA_INT_MAP_REG register
 * cache_ia interrupt configuration register
 */

#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xe0)

/* INTERRUPT_CORE0_CACHE_IA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map cache_ia interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_CACHE_IA_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_M  (INTERRUPT_CORE0_CACHE_IA_INT_MAP_V << INTERRUPT_CORE0_CACHE_IA_INT_MAP_S)
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_S  0

/* INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG register
 * systimer_target0 interrupt configuration register
 */

#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xe4)

/* INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * this register used to map systimer_target0 interrupt to one of core0's
 * external interrupt
 */

