apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_interrupt_core0.h
#define INTERRUPT_CORE0_DMA_IN_CH2_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_IN_CH2_INT_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH2_INT_MAP_V << INTERRUPT_CORE0_DMA_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH2_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_IN_CH2_INT_MAP_S  0

/* INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP_REG register
 * dma_in_ch3 interrupt configuration register
 */

#define INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x114)

/* INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_in_ch3 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP_V << INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_IN_CH3_INT_MAP_S  0

/* INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP_REG register
 * dma_in_ch4 interrupt configuration register
 */

#define INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x118)

/* INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_in_ch4 interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP_V << INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_IN_CH4_INT_MAP_S  0

/* INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP_REG register
 * dma_out_ch0 interrupt configuration register
 */

#define INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x11c)

/* INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch0 interrupt to one of core0's
 * external interrupt
 */

#define INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH0_INT_MAP_S  0

/* INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP_REG register
 * dma_out_ch1 interrupt configuration register
 */

#define INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x120)

/* INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch1 interrupt to one of core0's
 * external interrupt
 */

#define INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH1_INT_MAP_S  0

/* INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP_REG register
 * dma_out_ch2 interrupt configuration register
 */

#define INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x124)

/* INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch2 interrupt to one of core0's
 * external interrupt
 */

#define INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH2_INT_MAP_S  0

/* INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP_REG register
 * dma_out_ch3 interrupt configuration register
 */

#define INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x128)

/* INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch3 interrupt to one of core0's
 * external interrupt
 */

#define INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH3_INT_MAP_S  0

/* INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP_REG register
 * dma_out_ch4 interrupt configuration register
 */

#define INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x12c)

/* INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map dma_out_ch4 interrupt to one of core0's
 * external interrupt
 */

#define INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP_M  (INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP_V << INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_DMA_OUT_CH4_INT_MAP_S  0

/* INTERRUPT_CORE0_RSA_INT_MAP_REG register
 * rsa interrupt configuration register
 */

#define INTERRUPT_CORE0_RSA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x130)

/* INTERRUPT_CORE0_RSA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map rsa interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_RSA_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_RSA_INT_MAP_M  (INTERRUPT_CORE0_RSA_INT_MAP_V << INTERRUPT_CORE0_RSA_INT_MAP_S)
#define INTERRUPT_CORE0_RSA_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_RSA_INT_MAP_S  0

/* INTERRUPT_CORE0_AES_INT_MAP_REG register
 * aes interrupt configuration register
 */

#define INTERRUPT_CORE0_AES_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x134)

/* INTERRUPT_CORE0_AES_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * this register used to map aes interrupt to one of core0's external
 * interrupt
 */

#define INTERRUPT_CORE0_AES_INT_MAP    0x0000001f
#define INTERRUPT_CORE0_AES_INT_MAP_M  (INTERRUPT_CORE0_AES_INT_MAP_V << INTERRUPT_CORE0_AES_INT_MAP_S)
#define INTERRUPT_CORE0_AES_INT_MAP_V  0x0000001f
#define INTERRUPT_CORE0_AES_INT_MAP_S  0

/* INTERRUPT_CORE0_SHA_INT_MAP_REG register
 * sha interrupt configuration register
 */

#define INTERRUPT_CORE0_SHA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x138)

